tutorial/beamFluidInteractionCases/pitzDailyWithBeam/pitzDailyWithBeam/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolverLibs    ("libfiniteVolumeBeamMooring");

motionSolver        sixDoFRigidBodyMotionFvBeam;

sixDoFRigidBodyMotionFvBeamCoeffs
{
    patches         (upperWall);
    innerDistance   0.01;
    outerDistance   0.05;//0.5 worked up to 5.2s//0.35;
    mass 1;
    centreOfMass    (0.0618 0.0094 -0.006);
    rho rhoInf;
    rhoInf 1;


    // Cuboid moment of inertia about the centre of mass
    momentOfInertia (0 0 0);
    report          on;

    accelerationRelaxation 0.7; // this
    //accelerationDamping 0.9;

    solver
    {
        type FvBeamNewmark;
    }

    constraints
    {
      fixedOrientation
        {
          sixDoFRigidBodyMotionFvBeamConstraint   orientation;
          //axis                              (0.0618 0.0094 -0.006);
        }
      fixedPoint
        {
          sixDoFRigidBodyMotionFvBeamConstraint point;
          centreOfRotation (0 0 0);
        }
	//      //translation contrained on a plane around CoR
    //     fixedPlane
    //     {
    //         sixDoFRigidBodyMotionFvBeamConstraint plane;
    //         normal (0 1 0);
    //     }

	// // rotation constraint
    //     fixedAxis
    //     {
    //         sixDoFRigidBodyMotionFvBeamConstraint axis;
    //         axis (0 1 0);
    //     }
    }

	restraints
	{
		beam1
	{
		sixDoFRigidBodyMotionFvBeamRestraint finiteVolumeBeam;

		attachmentPatch	right;

		anchorPatch left;

		beamRegion 	"beamone";

		refAttachmentPt (0.062 0.0254 -0.0001828);
	}

//
}
}

// ************************************************************************* //
