tutorial/beamFluidInteractionCases/pitzDailyWithBeam/pitzDailyWithBeam/0.orig/div(U)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      div(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
63540
(
-631.777
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<scalar> 
300
(
-631.777
-631.777
-631.777
-631.777
-631.777
-631.777
-631.777
-631.777
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           uniform 0;
    }
    upperWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<scalar> 
1200
(
-631.777
-631.777
-631.777
-631.777
-631.777
-631.777
-631.777
-631.777
...
)
;
    }
    lowerWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<scalar> 
1470
(
-631.777
-631.777
-631.777
-631.777
-631.777
-631.777
-631.777
-631.777
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
