tutorial/beamFluidInteractionCases/pitzDailyWithBeam/pitzDailyWithBeam/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Mangroves
{
    type            fvBeamPorosity;
    active          yes;
    modelName    Darcy;
    k 1e-08;
    nu 0.001;
    rho 1;
    penalizationFactor 1e06;
    exponent 2.0;
}




// ************************************************************************* //
